---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricAreaType
source: html/ac1e177f-5041-418f-c220-962887091d3c.htm
---
# Autodesk.Revit.DB.Structure.FabricAreaType

A FabricAreaType object is used in FabricArea object generation.

## Syntax (C#)
```csharp
public class FabricAreaType : ElementType
```